Amiya200/stm32_water_tank/Core/Src/screen.c
        /* === SEMI AUTO === */
        case UI_SEMI_AUTO:
            if (!semiAutoEnabled) enable_semi_auto();
            else disable_semi_auto();
            ui = UI_DASH;
            break;

        /* === TIMER SLOT EDIT FLOW === */
        case UI_TIMER:
            // Entered only when coming from long press (handled in switches)
            // Short press toggles enable, handled in Screen_HandleButton()
            break;


        case UI_TIMER_SLOT_SELECT:
            ui = UI_TIMER_EDIT_SLOT_ON_H;
            break;

        case UI_TIMER_EDIT_SLOT_ON_H:
            ui = UI_TIMER_EDIT_SLOT_ON_M;
            break;

        case UI_TIMER_EDIT_SLOT_ON_M:
            ui = UI_TIMER_EDIT_SLOT_OFF_H;
            break;

        case UI_TIMER_EDIT_SLOT_OFF_H:
            ui = UI_TIMER_EDIT_SLOT_OFF_M;
            break;

        case UI_TIMER_EDIT_SLOT_OFF_M:
            ui = UI_TIMER_EDIT_SLOT_ENABLE;
            break;

        case UI_TIMER_EDIT_SLOT_ENABLE:
            apply_timer_slot(currentSlot);
            ui = UI_TIMER;
            break;

        /* === SEARCH === */
        case UI_SEARCH:
            ui = UI_SEARCH_EDIT_GAP;
            break;

        case UI_SEARCH_EDIT_GAP:
            ui = UI_SEARCH_EDIT_DRY;
            break;

        case UI_SEARCH_EDIT_DRY:
            ui = UI_SEARCH_EDIT_ON_H;
            break;

        case UI_SEARCH_EDIT_ON_H:
            ui = UI_SEARCH_EDIT_ON_M;
            break;

        case UI_SEARCH_EDIT_ON_M:
            ui = UI_SEARCH_EDIT_OFF_H;
            break;

        case UI_SEARCH_EDIT_OFF_H:
            ui = UI_SEARCH_EDIT_OFF_M;
            break;

        case UI_SEARCH_EDIT_OFF_M:
            apply_search_settings();
            ui = UI_SEARCH;
            break;


        /* === COUNTDOWN === */
        case UI_COUNTDOWN:
            if (countdownActive)
                ModelHandle_StopCountdown();
            else
                ui = UI_COUNTDOWN_EDIT_MIN;
            break;

        case UI_COUNTDOWN_EDIT_MIN:
            break;

        case UI_COUNTDOWN_TOGGLE: {
        	uint32_t seconds = (uint32_t)edit_countdown_min * 60u;
        	if (seconds == 0) seconds = 60;
        	apply_countdown_settings();
        	ui = UI_COUNTDOWN;

            break;
        }

        /* === TWIST === */
        case UI_TWIST:
            if (twistSettings.twistActive)
                ModelHandle_StopTwist();
            else
                ui = UI_TWIST_EDIT_ON;
            break;

        case UI_TWIST_EDIT_ON:
            ui = UI_TWIST_EDIT_OFF;
            break;

        case UI_TWIST_EDIT_OFF:
            ui = UI_TWIST_EDIT_ON_H;
            break;

        case UI_TWIST_EDIT_ON_H:
            ui = UI_TWIST_EDIT_ON_M;
            break;

        case UI_TWIST_EDIT_ON_M:
            ui = UI_TWIST_EDIT_OFF_H;
            break;

        case UI_TWIST_EDIT_OFF_H:
            ui = UI_TWIST_EDIT_OFF_M;
            break;

        case UI_TWIST_EDIT_OFF_M:
            apply_twist_settings();
            if (twistSettings.twistActive){
                ModelHandle_StartTwist(
                    twistSettings.onDurationSeconds,
                    twistSettings.offDurationSeconds,
                    twistSettings.onHour,
                    twistSettings.onMinute,
                    twistSettings.offHour,
                    twistSettings.offMinute
                );
            }

            ui = UI_TWIST;
            break;


        default:
            break;
    }

    screenNeedsRefresh = true;
}

/* ============================
   MENU RESET / BACK LOGIC
   ============================ */
static void menu_reset(void){
    refreshInactivityTimer();

    switch (ui) {
        /* Return to MENU from submodes */
        case UI_MANUAL:
        case UI_SEMI_AUTO:
        case UI_TIMER:
        case UI_SEARCH:
        case UI_COUNTDOWN:
        case UI_TWIST:
            ui = UI_MENU;
            break;

        /* From MENU → DASH, from DASH → WELCOME */
        case UI_MENU:
            ui = UI_DASH;
            break;
        case UI_DASH:
            ui = UI_WELCOME;
            break;

        /* Timer editing states → back to timer list */
        case UI_TIMER_SLOT_SELECT:
        case UI_TIMER_EDIT_SLOT_ON_H:
        case UI_TIMER_EDIT_SLOT_ON_M:
        case UI_TIMER_EDIT_SLOT_OFF_H:
        case UI_TIMER_EDIT_SLOT_OFF_M:
        case UI_TIMER_EDIT_SLOT_ENABLE:
            ui = UI_TIMER;
            break;

        case UI_SEARCH_EDIT_ON_H:
        case UI_SEARCH_EDIT_ON_M:
        case UI_SEARCH_EDIT_OFF_H:
        case UI_SEARCH_EDIT_OFF_M:
            ui = UI_SEARCH;
            break;

        case UI_TWIST_EDIT_ON:
        case UI_TWIST_EDIT_OFF:
        case UI_TWIST_EDIT_ON_H:
        case UI_TWIST_EDIT_ON_M:
        case UI_TWIST_EDIT_OFF_H:
        case UI_TWIST_EDIT_OFF_M:
            ui = UI_TWIST;
            break;


        /* Countdown editing → back to countdown */
        case UI_COUNTDOWN_EDIT_MIN:
            ui = UI_COUNTDOWN;
            break;



        default:
            ui = UI_MENU;
            break;
    }

    screenNeedsRefresh = true;
}

/* ============================
   SCREEN UPDATE (LCD REFRESH)
   ============================ */
void Screen_Update(void){
    uint32_t now = HAL_GetTick();

    bool cursorBlinkActive = false;
    switch (ui) {
        case UI_MENU:
        case UI_TIMER_EDIT_SLOT_ON_H:
        case UI_TIMER_EDIT_SLOT_ON_M:
        case UI_TIMER_EDIT_SLOT_OFF_H:
        case UI_TIMER_EDIT_SLOT_OFF_M:
        case UI_SEARCH_EDIT_GAP:
        case UI_SEARCH_EDIT_DRY:
        case UI_COUNTDOWN_EDIT_MIN:
        case UI_TWIST_EDIT_ON:
        case UI_TWIST_EDIT_OFF:
            cursorBlinkActive = true;
            break;
        default:
            cursorBlinkActive = false;
            cursorVisible = true;
            break;
    }

    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS)) {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        screenNeedsRefresh = true;
    }

    if (ui == UI_WELCOME && now - lastLcdUpdateTime >= WELCOME_MS) {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (ui != UI_WELCOME && ui != UI_DASH && (now - lastUserAction >= AUTO_BACK_MS)) {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (ui == UI_DASH && (now - lastLcdUpdateTime >= 1000)) {
        screenNeedsRefresh = true;
        lastLcdUpdateTime = now;
    }

    if (screenNeedsRefresh || ui != last_ui) {
        bool fullRedraw = (ui != last_ui);
        last_ui = ui;
        screenNeedsRefresh = false;
        if (fullRedraw) lcd_clear();

        switch (ui) {
            case UI_WELCOME:     show_welcome(); break;
            case UI_DASH:        show_dash(); break;
            case UI_MENU:        show_menu(); break;
            case UI_MANUAL:      show_manual(); break;
            case UI_SEMI_AUTO:   show_semi_auto(); break;
            case UI_TIMER:       show_timer(); break;
            case UI_SEARCH:      show_search(); break;
            case UI_COUNTDOWN:   show_countdown(); break;
            case UI_TWIST:       show_twist(); break;

