Amiya200/stm32_water_tank/Core/Src/screen.c
            default: break;
        }

        screenNeedsRefresh = true;
        return;
    }


    /* ======================================================
       ===================== SELECT KEY =====================
       ====================================================== */
    if (b == BTN_SELECT) {

        switch (ui) {

            /* ==================== TIMER MODE ==================== */
            case UI_TIMER:
                /* ⭕ FIXED:
                   Short press → Enter slot edit UI
                   (Enable toggle is moved to long press SW4 to avoid conflict)
                */
                ui = UI_TIMER_SLOT_SELECT;
                screenNeedsRefresh = true;
                return;


            /* Slot selected → go to ON HOUR edit */
            case UI_TIMER_SLOT_SELECT:
                ui = UI_TIMER_EDIT_SLOT_ON_H;
                break;

            case UI_TIMER_EDIT_SLOT_ON_H:
                ui = UI_TIMER_EDIT_SLOT_ON_M;
                break;

            case UI_TIMER_EDIT_SLOT_ON_M:
                ui = UI_TIMER_EDIT_SLOT_OFF_H;
                break;

            case UI_TIMER_EDIT_SLOT_OFF_H:
                ui = UI_TIMER_EDIT_SLOT_OFF_M;
                break;

            case UI_TIMER_EDIT_SLOT_OFF_M:
                ui = UI_TIMER_EDIT_SLOT_ENABLE;
                break;

            case UI_TIMER_EDIT_SLOT_ENABLE:
                apply_timer_slot(currentSlot);      // ⭕ SAVE CHANGES
                ui = UI_TIMER;
                break;


            /* =================== SEARCH =================== */
            case UI_SEARCH:
                if (searchSettings.searchActive)
                    ModelHandle_StopSearch();
                else
                    ModelHandle_StartSearch(edit_search_gap_s, edit_search_dry_s);
                break;

            case UI_SEARCH_EDIT_GAP:
                ui = UI_SEARCH_EDIT_DRY;
                break;

            case UI_SEARCH_EDIT_DRY:
                apply_search_settings();
                ui = UI_SEARCH;
                break;


            /* =================== TWIST =================== */
            case UI_TWIST:
                if (twistSettings.twistActive)
                    ModelHandle_StopTwist();
                else
                    ModelHandle_StartTwist(edit_twist_on_s, edit_twist_off_s);
                break;

            case UI_TWIST_EDIT_ON:
                ui = UI_TWIST_EDIT_OFF;
                break;

            case UI_TWIST_EDIT_OFF:
                apply_twist_settings();
                ui = UI_TWIST;
                break;


            /* ================= COUNTDOWN ================= */
            case UI_COUNTDOWN:
                if (countdownActive)
                    ModelHandle_StopCountdown();
                else
                    ui = UI_COUNTDOWN_EDIT_MIN;
                break;

            case UI_COUNTDOWN_EDIT_MIN:
                /* next screen will handle save */
                break;

            case UI_COUNTDOWN_TOGGLE:
            {
                uint32_t seconds = edit_countdown_min * 60u;
                if (seconds == 0) seconds = 60;
                apply_countdown_settings();
                ui = UI_COUNTDOWN;
                break;
            }


            /* ================= OTHER MENUS ================= */
            default:
                menu_select();
                break;
        }

        screenNeedsRefresh = true;
        return;
    }
}
